{
  "movie": [
    {
      "id": 1,
      "title": "Spirited Away",
      "year_release": 2001,
      "detail": "10-year-old Chihiro moves with her parents to a new home in the Japanese countryside. After taking a wrong turn down a wooded path, Chihiro and her parents discover an amusement park with a stall containing an assortment of food. To her surprise, Chihiro's parents begin eating and then transform into pigs. In this supernatural realm, Chihiro encounters a host of characters and endures labor in a bathhouse for spirits, awaiting a reunion with her parents.",
      "image": "https://m.media-amazon.com/images/M/MV5BMjlmZmI5MDctNDE2YS00YWE0LWE5ZWItZDBhYWQ0NTcxNWRhXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
      "trailer_url": "https://www.youtube.com/watch?v=bkpMLAM0U7U",
      "favorite": true
    },
    {
      "id": 2,
      "title": "My Neighbor Totoro",
      "year_release": 1988,
      "detail": "This acclaimed animated tale by director Hayao Miyazaki follows schoolgirl Satsuke and her younger sister, Mei, as they settle into an old country house with their father and wait for their mother to recover from an illness in an area hospital. As the sisters explore their new home, they encounter and befriend playful spirits in their house and the nearby forest, most notably the massive cuddly creature known as Totoro.",
      "image": "https://m.media-amazon.com/images/M/MV5BYzJjMTYyMjQtZDI0My00ZjE2LTkyNGYtOTllNGQxNDMyZjE0XkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
      "trailer_url": "https://www.youtube.com/watch?v=92a7Hj0ijLs",
      "favorite": true
    },
    {
      "id": 3,
      "title": "Princess Mononoke",
      "year_release": 1997,
      "detail": "A prince becomes involved in the struggle between a forest princess and the encroachment of mechanization.",
      "image": "https://upload.wikimedia.org/wikipedia/en/8/8c/Princess_Mononoke_Japanese_poster.png",
      "trailer_url": "https://www.youtube.com/watch?v=4OiMOHRDs14",
      "favorite": false
    },
    {
      "id": 4,
      "title": "Ponyo",
      "year_release": 2008,
      "detail": "During a forbidden excursion to see the surface world, a goldfish princess encounters a human boy named Sosuke, who gives her the name Ponyo. Ponyo longs to become human, and as her friendship with Sosuke grows, she becomes more humanlike. Ponyo's father brings her back to their ocean kingdom, but so strong is Ponyo's wish to live on the surface that she breaks free, and in the process, spills a collection of magical elixirs that endanger Sosuke's village.",
      "image": "https://m.media-amazon.com/images/M/MV5BOTc3YmM3N2QtODZkMC00ZDE5LThjMTQtYTljN2Y1YTYwYWJkXkEyXkFqcGdeQXVyODEzNjM5OTQ@._V1_FMjpg_UX1000_.jpg",
      "trailer_url": "https://www.youtube.com/watch?v=CsR3KVgBzSM",
      "favorite": false
    },
    {
      "id": 5,
      "title": "Howl's Moving Castle",
      "year_release": 1999,
      "detail": "Sophie has an uneventful life at her late father's hat shop, but all that changes when she befriends wizard Howl, who lives in a magical flying castle. However, the evil Witch of Waste takes issue with their budding relationship and casts a spell on young Sophie, which ages her prematurely. Now Howl must use all his magical talents to battle the jealous hag and return Sophie to her former youth and beauty.",
      "image": "https://m.media-amazon.com/images/M/MV5BNmM4YTFmMmItMGE3Yy00MmRkLTlmZGEtMzZlOTQzYjk3MzA2XkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_FMjpg_UX1000_.jpg",
      "trailer_url": "https://www.youtube.com/watch?v=iwROgK94zcM",
      "favorite": true
    },
    {
      "title": "The Secret World Of Arrietty",
      "year_release": 2010,
      "image": "https://fr.web.img2.acsta.net/medias/nmedia/18/82/01/13/19597854.jpg",
      "trailer_url": "https://www.youtube.com/watch?v=VlMe7PavaRQ",
      "detail": "Arrietty, a tiny teenager, lives with her parents in the recesses of a suburban home, unbeknown to the homeowner and housekeeper. Like others of her kind, Arrietty remains hidden from her human hosts, but occasionally ventures forth from beneath the floorboards to borrow sugar cubes and other supplies. A secret friendship forms when 12-year-old Shawn meets Arrietty, but their relationship could spell danger for Arrietty's family.",
      "id": 6,
      "favorite": false
    },
    {
      "favorite": false,
      "title": "Kiki's Delivery Service",
      "image": "https://m.media-amazon.com/images/M/MV5BYTQ1ZTM1ZTgtN2Q2Ny00YjFkLTliNjEtN2I1ZmY5ZTY1OTEzXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_FMjpg_UX1000_.jpg",
      "year_release": 1989,
      "detail": "13-year-old Kiki moves to a seaside town with her talking cat, Jiji, to spend a year alone, in accordance with her village's tradition for witches in training. After learning to control her broomstick, Kiki sets up a flying courier service and soon becomes a fixture in the community. But when the insecure young witch begins questioning herself and loses her magic abilities, she must overcome her self-doubt to get her powers back.",
      "trailer_url": "https://www.youtube.com/watch?v=4bG17OYs-GA",
      "id": 7
    },
    {
      "favorite": false,
      "title": "The Wind Rises",
      "image": "https://static.wikia.nocookie.net/studio-ghibli/images/2/2d/The_Wind_Rises.jpg/",
      "trailer_url": "https://www.youtube.com/watch?v=RzSpDgiF5y8",
      "year_release": 2013,
      "detail": "A lifelong love of flight inspires Japanese aviation engineer Jiro Horikoshi, whose storied career includes the creation of the A-6M World War II fighter plane.",
      "id": 8
    },
    {
      "favorite": false,
      "title": "Nausicaä of the Valley of the Wind",
      "year_release": 1984,
      "image": "https://m.media-amazon.com/images/M/MV5BZTI3NmJmYTQtNDg4NS00M2VlLTgzZDAtZWIwZDcyOWY5YzIzXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
      "detail": "Far in the future, after an apocalyptic conflict has devastated much of the world's ecosystem, the few surviving humans live in scattered semi-hospitable environments within what has become a \"toxic jungle.\" Young Nausicaä lives in the arid Valley of the Wind and can communicate with the massive insects that populate the dangerous jungle. Under the guidance of the pensive veteran warrior, Lord Yupa, Nausicaä works to bring peace back to the ravaged planet.",
      "trailer_url": "https://www.youtube.com/watch?v=6zhLBe319KE",
      "id": 9
    },
    {
      "favorite": false,
      "title": "From Up on Poppy Hill",
      "year_release": 2011,
      "trailer_url": "https://www.youtube.com/watch?v=9nzpk_Br6yo",
      "image": "https://static.wikia.nocookie.net/studio-ghibli/images/d/dd/From_Up_On_Poppy_Hill.jpg/",
      "detail": "It is based on the 1980 serialized manga of the same name illustrated by Chizuru Takahashi and written by Tetsurō Sayama. Set in 1963 Yokohama, Japan, the film tells the story of Umi Matsuzaki, a high school girl living in her grandmother's boarding house called \"Coquelicot Manor\". When Umi meets Shun Kazama, a member of the school's newspaper club, they decide to clean up the school's clubhouse, Quartier Latin. However, Tokumaru, the chairman of the local high school and a businessman, intends to demolish the building for redevelopment and Umi and Shun, along with Shirō Mizunuma, must persuade him to reconsider.",
      "id": 10
    },
    {
      "favorite": false,
      "title": "Porco Rosso",
      "year_release": 1992,
      "image": "https://m.media-amazon.com/images/M/MV5BNTZjMDc2N2UtZTdjZi00ODljLTgyZmEtNDljZDAwODY4NDVhXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_FMjpg_UX1000_.jpg",
      "trailer_url": "https://www.youtube.com/watch?v=awEC-aLDzjs",
      "detail": "World War I flying ace Marco Pagott mysteriously turns from a man into a pig after all his comrades die in battle. Now known as Porco Rosso, the pilot continues fighting air pirates while, on the ground, flirting with a gorgeous club singer. After an attack by a brash American pilot, Porco meets confident Fio, who repairs his plane with her girl mechanics, and sees him for who he really is.",
      "id": 11
    },
    {
      "favorite": false,
      "image": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7b/Whisper_of_the_Heart.jpg",
      "title": "Whisper of the Heart",
      "year_release": 1995,
      "detail": "Based on the manga with the same title, this animated film follows Shizuku, an inquisitive young girl and a voracious reader, who longs to be a writer when she grows up. One day she notices that all of her library books have previously been taken out by one Seiji Amasawa. Amid chasing after a large cat, befriending an eccentric antiques dealer and writing her first novel, Shizuku aims to find this mysterious boy who may well be her soul mate.",
      "trailer_url": "https://www.youtube.com/watch?v=0pVkiod6V0U",
      "id": 12
    },
    {
      "favorite": false,
      "title": "Lupin III: The Castle of Cagliostro",
      "year_release": 1979,
      "image": "https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p8116000_p_v10_ab.jpg",
      "detail": "Arsene Lupin III, the world's most daring thief, pulls off a heist at a Monte Carlo casino. But, when he discovers his haul is nothing more than a pile of counterfeit bills, Lupin traces the money to a villainous count in the small country of Cagliostro. With his trusty comrades, Lupin travels to Cagliostro, where he meets a beautiful but unhappy princess. As Lupin tries to unravel the count's secrets, he find himself drawn into a bigger mystery.",
      "trailer_url": "https://www.youtube.com/watch?v=wJudurbkv1E",
      "id": 13
    },
    {
      "favorite": false,
      "title": "Castle in the Sky",
      "year_release": 1986,
      "detail": "Young orphan Sheeta and her kidnapper, Col. Muska, are flying to a military prison when their plane is attacked by a gang of air pirates led by the matronly Dola. Escaping from a mid-air collision via a magic crystal around her neck, Sheeta meets fellow orphan Pazu and the pair join forces to discover the mystical floating city of Laputa while pursued by both Muska and the pirates, who lust for the city's myriad treasures.",
      "trailer_url": "https://www.youtube.com/watch?v=8ykEy-yPBFc",
      "image": "https://realwomenofgaming.files.wordpress.com/2023/06/cits2.jpg",
      "id": 14
    },
    {
      "favorite": false,
      "title": "The Boy and the Heron",
      "year_release": 2023,
      "detail": "A young boy named Mahito yearning for his mother ventures into a world shared by the living and the dead. There, death comes to an end, and life finds a new beginning. A semi-autobiographical fantasy about life, death, and creation, in tribute to friendship",
      "image": "https://m.media-amazon.com/images/M/MV5BZjZkNThjNTMtOGU0Ni00ZDliLThmNGUtZmMxNWQ3YzAxZTQ1XkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_FMjpg_UX1000_.jpg",
      "trailer_url": "https://www.youtube.com/watch?v=f7EDFdA10pg",
      "id": 16
    },
    {
      "favorite": false,
      "title": "Grave of the Fireflies",
      "year_release": 1988,
      "detail": "On the final days of World War II, 14-year-old Seita and his four-year-old sister Setsuko are orphaned after their mother is killed during an air-raid by American forces in Kobe, Japan. After having a falling-out with their aunt, they move into an abandoned bomb shelter. With no surviving relatives and their emergency funds and rations depleted, Seita and Setsuko must struggle to survive their hardships as well as those of their country, which is on the losing end of the war.",
      "image": "https://images.hive.blog/DQmPVfMBBvxYvjxBSuumqo5p7826VNAEhMhJxfGQBfWynqf/p158931_p_v10_aa.jpg",
      "trailer_url": "https://www.youtube.com/watch?v=4vPeTSRd580",
      "id": 17
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  }
}